#include <stdio.h>

int t05() {
    printf("\n###############\n");
    printf("# %%f\n");
    printf("###############\n");
    // f格式符
    float f1 = 12.34567;
    printf("f1[%%f]: %f\n", f1);
    // 1. %m.nf: 指定输出的数据共占m列, 其中n位小数. 如果数值长度小于m, 则左端补空格.
    printf("f1[%%10.2f]: %10.2f\n", f1);
    // 2. %-m.nf: 指定输出的数据共占m列, 其中有n位小数. 如果数值长度小于m, 则右端补空格.
    printf("f1[%%-10.2f]: %-10.2f\n", f1);

    printf("\n###############\n");
    printf("# %%s\n");
    printf("###############\n");
    // s格式符
    char s1[] = {"Hello world !"};
    printf("s1[%%s]: %s\n", s1);
    // 1. %ms: 输出字符串占m列, 如果字符串长度大于m, 则突破m的限制, 输出全部字符串.
    // 如果字符串的长度小于m, 则左端补空格.
    printf("s1[%%2s]: %2s\n", s1);
    printf("s1[%%20s]: %20s\n", s1);
    // 2. %-ms: 如果字符串长度小于m, 字符串靠左, 右端补空格.
    printf("s1[%%-20s]: %-20s\n", s1);
    // 3. %m.ns: 输出占m列, 但只取字符串左端n个字符, 这n个字符输出在m列的右侧, 左端补空格.
    printf("s1[%%20.2s]: %20.2s\n", s1);
    printf("s1[%%.2s]: %.2s\n", s1);
    // 4. %-m.ns: 输出占m列, 但只取字符串左端n个字符, 这n个字符输出在m列的左侧, 右端补空格.
    printf("s1[%%-20.2s]: %-20.2s\n", s1);


    return 0;
}